{"fourchan": ["hey /trv/ I've recently become completely enamored with the idea of traveling to the Faroe islands, has anyone here actually visited this place and if so could we get a /faroe/ general going on? I'm thinking about going sometime this spring by way of Dublin but honestly any advice or recommendations would be of help.", "tony blair and bill clinton, serbs unironically did nothing wrong. ", "HOLY SHIT THIS IS REAL", "Yahtzee from Zero Punctuation said that modern politics is like two groups of people playing on a basketball court with a wall separating them scoring points by themselves as though it proves that the other side is worse. It explains why these people only get more insane and more desperate as time goes on.", "end fursecution", "HDD", "You will only get hate here, but know there are some believers in your midst. ", "Told my dad to talk to someone about protecting his money. Heres what some guy at Fidelity said.", "More burger places should be open at 4AM. I crave the combination of meat, cheese and bread right now."], "reddit": ["To be really pedantic the Roman Empire never ended if you count continuations of presence. The Papal State and the Pope himself is a continuation of the Pontifex Maximus title, an illustrious position held by powerful men such as Gaius Julius Caesar. On a side note the Italians during World War II consciously chose to recall their Roman heritage (because of course) and make suggestions about a new Roman Empire. This dream was crushed pretty quickly when they were forced to realize that war requires industry, and Italy doesn’t have enough for that.", "Aren’t gingerbread houses really just a decoration? Why don’t you just make one as a decoration you can keep up for a few weeks and not eat, and make soft ginger cookies, I’ve really never heard of people eating these, besides, if you ate it before it was stale you’d only have it as a decoration for a day or two? ", "I did something similar when I visited a month ago. We hired a trip from Marrakech to the desert with beautiful stops like Ait Ben Haddou and others. The desert was amazing: we stayed at a Berber camp that took 1 hour by camel to reach and we loved it. We had great weather and could observe a starry night in a way we hadn't done before. Mesmerizing.", "INvoluntary CELibate. Typically men who have been bruned by women in the past and now believe they can and will live fulfilling lives while still harboring intense harsh feelings towards a certain group for something that, in the end, is probably their own fault. ", "Got a higher res?", "Same issues, multiple knee surgeries and lots of international travel. Use the bathroom often, do some deep squats, lunges near the rear and if the attendants don’t mind stay standing awhile. Compliment them on something (last one had my grandmothers first name) and you will usually get free treats. \n\nIn the seat, I cross one leg frequently or pull it up close so my foot is on my seat for a few minutes at a time. Continued forced elasticity is very helpful. ", "I knew a chick like that in highschool. She was 6‘1'' and never had a bf, but reportedly started to partake in group lesbian  sex parties sometime. \nShe had a cute innocent face, but a huge manly body. So wierd.", "I was here a year ago. Absolutely beautiful city, highlight of the trip! Hope it's treating you just as well. ", "I’ve had to push for as long as I can remember, and found out (incidentally, when I had unrelated kidney stones) that my bladder is positioned weird so the outlet is at such an angle that I have to overcome the pressure - sort of like a kinked hose. Some people just have different anatomy. Also some men who push have prostate issues.", "\" Hi, Soon To Be Boss, I just received my offer letter, and noticed the salary is a bit different than we discussed. I just wanted to confirm with you this was correct before I sign this and return it back to you? Thank you!\" \n\nHonesty is always the best policy. Plus, it shows integrity in this case.", "Not sure if they're really stages, but I'm a hell of a lot more alert when I get to the office at 8 than when I stumble out of bed at 630. ", "I think that would actually be pretty nice.  Give both management and corporate a call (don't mention the gift card!) to let them know she's doing a great job as well.  People are quick to complain, but compliments to higher ups can be valuable.", "Naval advantage was a big part of why the war was won, but as far as casualties go I'd say a lot more of that was down to modern arms and modern tactics and training. Plus a lot of the british troops were veteran soldiers.", "If you don't do it, you owe each of us 30K\n", "Carbonara. Load it up with cheese, pepper, hella bacon/pancetta/guanciale, and extra egg yolks. Make a trough of it, put it in a salad serving bowl, and rest that on my chest while watching a movie and drinking wine.", "I was here a year ago. Absolutely beautiful city, highlight of the trip! Hope it's treating you just as well. ", "I knew a chick like that in highschool. She was 6‘1'' and never had a bf, but reportedly started to partake in group lesbian  sex parties sometime. \nShe had a cute innocent face, but a huge manly body. So wierd.", "PCH is tough to beat.", "Pretty sure that is just a result of conditioning. You have always been covered (without your decision) and now you want to be covered. Utility and feeling protected make sense, but most of it conditioning.\n\nBody functions slow down during sleep and temperatures lower. Body transfers extra heat to the limbs to dissipate. This is why you can be comfortable covering just your torso and leaving limbs out. And why during sports you can cool off effectively via your limbs uncovered.", "My cat woke me up three times last night to give me head bumps and then sit on my chest and purr in my face. Hes my favorite ", "I miss Tartu and Raekoja Plats! Coming back next summer though!", "scrambled means scrambled, that waiter was trying to cover thier ass. Badly.", "Totally depends where in Italy you want to go. For Rome, you could live very well on €200 a day - in a rural part of the south you could do less than half of that.\n\nCosts can be knocked down quite a lot by taking public transport, staying in basic accommodation and eating pizza/focaccia from snack shops for your meals (€2-4). Depends what kind of trip you want.\n\n", "GOD DAMNIT I AM TOO MENTALLY UNSTABLE FOR THIS ", "Spiders can go for many weeks without a meal. Web weaving spiders are ambush predators who can basically sit still and do nothing and consume nearly no energy and maintain homeostasis for a long time.", "If anon was looking attractive she’ll have found it cute. If not he ends up as a creepy robot. ", "I'm afraid to say the doctor has a harsh diagnosis, your cancer has cancer. We can't tell if that's good news or bad. Were prescribing a tablet of manjaro twice a day until the meme expires.", "You need to get 5.2, or 6 out of 65 questions correct to score high enough on that 30% of the class to finish with a  50. You have a 47.6 in the course now, even if you didn't take the final. ", "You need to get 5.2, or 6 out of 65 questions correct to score high enough on that 30% of the class to finish with a  50. You have a 47.6 in the course now, even if you didn't take the final. ", "I like thyme and cayenne, s+p on roasted vegetables. I know it's not what you want, but it's a favourite of mine. "]}